{
  "backend/main.mo": "Main Motoko actor defining comprehensive HEV suit system types (stats, modules, hazards, life support, vehicles, factions) and query/update functions for managing suit state, environmental hazards, vehicle diagnostics, faction modes, and system operations with migration support.",
  "backend/migration.mo": "Migration module that currently performs no-op state transformation, returning old state unchanged to support future upgrade compatibility.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including black screen fix, four-faction HUD system, tactical tab, faction-specific custom tabs, and vehicles tab with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component functionality, state management, UI features, and faction-specific implementations across tabs, HUD elements, and utility components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining color schemes, spacing, and theme tokens for both light and dark modes using OKLCH color space.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, theme color configuration, and viewport settings for mobile-optimized H.E.V HUD interface.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, display mode (standalone), theme colors, and orientation settings for H.E.V Mark IV HUD System.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy with runtime caching for offline support, precaching critical assets (overlays, diagrams), and automatic cache cleanup on activation.",
  "frontend/src/App.tsx": "Root application component managing boot sequence, faction switching, tab navigation, image preloading, service worker registration, backend module sync, and conditional tab availability based on faction with error boundary and query client setup.",
  "frontend/src/audio/audioBus.ts": "Central audio bus singleton that manages AudioContext initialization, autoplay unlocking, and provides methods to play SFX, voice, alert sequences, and layered audio with volume control.",
  "frontend/src/audio/hevVoice.ts": "HEV-style voice announcement helpers that check voice settings and trigger audio playback for various game events like module toggles, health warnings, stat changes, and system events.",
  "frontend/src/audio/uiSfx.ts": "UI sound effects helpers that check voice settings and play audio for common UI interactions like tab switches, toggles, button clicks, and confirmations.",
  "frontend/src/components/audio/AmbiencePlayer.tsx": "Audio player component with playback controls, volume slider, loop toggle, and custom track upload functionality using the audio store.",
  "frontend/src/components/audio/RadioControlPanel.tsx": "Radio communications panel with frequency tuning, channel selection, signal strength display, message broadcasting, and transmission history that varies by faction style.",
  "frontend/src/components/boot/BootSequenceOverlay.tsx": "Full-screen boot sequence overlay that displays progressive system initialization stages with progress bar, optional glitch effects, and faction-specific logo reveal.",
  "frontend/src/components/boot/FactionSwitchOverlay.tsx": "Full-screen overlay that displays during faction switching with animated progress bar, faction logo, and completion callback.",
  "frontend/src/components/common/HudDivider.tsx": "Simple HUD divider component with optional decorative corners and line styling.",
  "frontend/src/components/common/HudSection.tsx": "Reusable HUD section container with optional title, collapsible functionality, and chevron indicator.",
  "frontend/src/components/common/HudSwitch.tsx": "A wrapper component around the base Switch UI component that adds HUD-specific styling via the 'hud-switch' className.",
  "frontend/src/components/common/HudTooltip.tsx": "A wrapper component around the base Tooltip UI component that provides HUD-styled tooltips with configurable side positioning and delay duration.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches errors, displays a themed error screen with the error message, and provides a system restart button.",
  "frontend/src/components/hazards/EnvironmentalHazardsPanel.tsx": "Displays a vertical list of five environmental hazards (fire, bio, radiation, electrical, gas) with progress bars, status text, and color-coded severity levels from the hazards store.",
  "frontend/src/components/hazards/HorizontalHazardPanel.tsx": "Displays environmental hazards in a horizontal grid layout with abbreviated labels, icons, progress bars, and severity-based styling.",
  "frontend/src/components/hev/ContaminationMonitorPanel.tsx": "Displays contamination monitoring data including exposure levels (surface, airborne, biological), decontamination status, airborne hazard analysis, and suit breach warnings.",
  "frontend/src/components/hev/EnvironmentalProtectionPanel.tsx": "Shows environmental protection system status including respirator efficiency, hazmat seal integrity, temperature regulation, and atmospheric composition readings.",
  "frontend/src/components/hev/RadiationAnalysisPanel.tsx": "Displays radiation analysis data including dosimeter readings, accumulated dose, isotope identification, shielding effectiveness, and safe exposure time calculations from the hazards store.",
  "frontend/src/components/hud/CriticalStatAlert.tsx": "A wrapper component that adds a pulsing colored border and shadow around child elements when a critical stat threshold is reached, with reduced motion support.",
  "frontend/src/components/hud/DamageIndicator.tsx": "Displays a directional red gradient flash overlay when damage is taken, with configurable direction (top/bottom/left/right) and auto-dismissal after animation completes.",
  "frontend/src/components/hud/EmergencyModeView.tsx": "Full-screen emergency mode interface showing critical vitals, environmental hazards, emergency SOS panel, and medical module toggles with system-style-specific titles and exit controls.",
  "frontend/src/components/hud/EnhancedStatusIndicators.tsx": "Displays contextual status badges (shield boost, hazards, low ammo, critical health, radio offline) with tooltips based on suit stats, hazards, and settings.",
  "frontend/src/components/hud/FactionLayoutWrapper.tsx": "Wraps children with faction-specific CSS classes based on system style (HEV, HECU, Guard, Resistance) for themed layouts.",
  "frontend/src/components/hud/HudGlobalEffects.tsx": "Renders non-interactive visual overlays including bloom, critical flash, presence glow, and HL1 scanlines, respecting reduced motion preferences.",
  "frontend/src/components/hud/HudLayout.tsx": "Main HUD container that applies faction styling, UI scaling, opacity, and renders header with faction name, operator name, and status indicators.",
  "frontend/src/components/hud/HudOfflineOverlay.tsx": "Displays a warning overlay when the HUD system is disabled, prompting user to restore it via the INFO tab.",
  "frontend/src/components/hud/HudTabsBar.tsx": "Renders navigation tabs (Basics, Medical, Info, Utilities, Weapons, Hazards, Tactical, Vehicles, Settings) with micro-indicators for warnings and an emergency mode button.",
  "frontend/src/components/hud/LowAmmoWarning.tsx": "Shows a pulsing yellow alert icon with 'LOW' text when ammunition falls below 20%, respecting reduced motion preferences.",
  "frontend/src/components/hud/MarkIGlitchOverlay.tsx": "Renders visual glitch effects (flickering, scanline sweep, color shift) specifically for Mark I HEV suit mode using custom hooks.",
  "frontend/src/components/hud/MinimalHudView.tsx": "Displays a simplified HUD with core stats (health, armor, ammo, aux), critical warnings, horizontal hazard panel, and a button to restore standard view.",
  "frontend/src/components/hud/Panels.tsx": "Provides StatPanel and MeterPanel components with different visual styles (HL1 segmented, HL2 numerical, custom) for displaying stats with bars and status colors.",
  "frontend/src/components/hud/TacticalHudShell.tsx": "Wraps content with a tactical HUD layout featuring top bar, left/right sidebars with combat stats (health, armor, aux power), and a center reticle overlay. Only renders tactical UI for Mark III+ suits based on feature flags.",
  "frontend/src/components/hud/TacticalOverlay.tsx": "Renders a full-screen tactical overlay with corner frames, center reticle, and multiple readout panels displaying combat status (threat level, targeting, heart rate, enemy locator, etc.).",
  "frontend/src/components/info/CharacterBackstoryPanel.tsx": "Displays a collapsible operator profile panel showing character biography, role, achievements, and context based on the selected operator name from settings.",
  "frontend/src/components/info/CommandConsole.tsx": "Interactive command-line console with input history navigation (arrow keys), command execution via executeCommand, scrollable output, and system log integration.",
  "frontend/src/components/info/ConfirmActionModal.tsx": "Reusable confirmation dialog modal with customizable title/description, confirm/cancel actions, and UI sound effects on user interaction.",
  "frontend/src/components/info/DataVisualization.tsx": "Provides three data visualization components: Sparkline (line chart), RadialGauge (circular progress), and BarChart (horizontal bars with progress indicators).",
  "frontend/src/components/info/EquipmentDescriptionsPanel.tsx": "Displays collapsible H.E.V. equipment modules with specifications, capabilities, and operational notes for each module category.",
  "frontend/src/components/info/OperatorProfilePanel.tsx": "Displays operator profile information including name, designation, clearance level, suit serial, neural link status, biometric ID, and mission time. Adapts labels and designations based on the selected system style (HECU, security, guard, resistance).",
  "frontend/src/components/info/SuitLorePanel.tsx": "Renders a collapsible panel displaying H.E.V. suit lore and history sections from imported suit lore data. Uses Collapsible components to toggle visibility of each lore section.",
  "frontend/src/components/info/SuitSubsystemReadouts.tsx": "Displays suit subsystem status (life support, environmental protection, power, communications, HUD) with interactive toggles for radio link, HUD online, and display mode. Shows confirmation modals before disabling critical systems and logs changes with audio feedback.",
  "frontend/src/components/info/SystemDiagnosticsPanel.tsx": "Shows real-time system diagnostics including module load, power consumption, system health, and network status with progress bars and status badges. Computes diagnostics from suit stats, modules, and hazard levels.",
  "frontend/src/components/info/SystemLogView.tsx": "Renders a scrollable system log view displaying timestamped log entries with type and message. Shows \"No log entries\" when the log is empty.",
  "frontend/src/components/medical/MedicalDiagram.tsx": "Displays a schematic H.E.V. suit diagram image with color-coded overlays for head, torso, and arms showing health/armor percentages. Overlay colors change based on status values.",
  "frontend/src/components/medical/MedicalInteractivePanels.tsx": "Provides interactive medical control panels for neural interface status and advanced medical systems (pain suppression, auto-stimulant, nano-repair, bio-monitor). Includes LimbIntegrityPanel and EmergencySosPanel with toggle switches that log actions and play audio feedback.",
  "frontend/src/components/medical/MedicalReadouts.tsx": "Displays comprehensive medical readouts including vital signs (heart rate, blood pressure, respiration, oxygen, temperature) and trauma assessment (suit integrity, tissue damage, blood loss). Calculates dynamic values based on health and hazard levels with status-based styling.",
  "frontend/src/components/medical/panels/EmergencySosPanel.tsx": "Emergency SOS system panel with arming, signal spoofing (\"Polite Panic Mode\"), and test burst transmission functionality. Displays beacon status, signal integrity, and transmission history with visual state indicators.",
  "frontend/src/components/medical/panels/LimbIntegrityPanel.tsx": "Displays integrity, servo load, fracture probability, and calibration status for each limb (arms and legs). Allows toggling calibration per limb and updates stats based on suit health state.",
  "frontend/src/components/military/AdvancedTacticalPanel.tsx": "Tactical information panel showing threat assessment, fire support availability, engagement protocols (ROE, OPORD), and tactical overlay data (grid reference, elevation, bearing).",
  "frontend/src/components/military/ExpandedWeaponsPanel.tsx": "Displays detailed weapon specifications including damage, range, penetration, ammo type, and operational readiness for multiple weapons (SMG, LMG, Sniper).",
  "frontend/src/components/military/SquadStatusPanel.tsx": "Shows squad member status including callsign, role, health, armor, position, and communication status. Displays visual health/armor progress bars and status badges.",
  "frontend/src/components/security/AccessControlPanel.tsx": "Access control interface for managing door locks with lockdown functionality. Displays door status, clearance levels, security verification progress, and emergency protocol status.",
  "frontend/src/components/security/FacilityMapPanel.tsx": "Displays an interactive facility map with zoom controls, sector markers, and vent access points overlaid on a static image. Allows users to select sectors and view their names.",
  "frontend/src/components/security/SecurityCameraGrid.tsx": "Renders a grid of security camera feeds with status indicators (active/offline/recording), allows camera selection and cycling through feeds. Displays camera location and timestamp information.",
  "frontend/src/components/settings/HevMarkSelector.tsx": "Provides UI for selecting H.E.V. suit marks (Prototype through Mark V) with visual style and functional profile options. Supports separating visual style from functional characteristics with a toggle switch.",
  "frontend/src/components/tactical/MissionBriefingDisplay.tsx": "Displays mission objectives with completion status, priority levels, and waypoints with distance/bearing information. Title adapts based on system style (HECU/Guard/default).",
  "frontend/src/components/tactical/QuickAccessControls.tsx": "Provides a grid of quick-access buttons for toggling suit modules (flashlight, helmet, respirator, radiation shield, boost, hazard system). Integrates with suit state and plays UI sound effects.",
  "frontend/src/components/tactical/RadarPanel.tsx": "Renders an animated radar display on canvas with sweeping scan line, concentric circles, and animated contact markers (friendly/hostile/unknown) with pulsing effects and position drift. Respects reduced motion preferences.",
  "frontend/src/components/tactical/ThreatAssessmentPanel.tsx": "Displays a threat assessment panel that calculates and visualizes an aggregate threat level based on environmental hazards, suit armor, and operator health, with contextual recommendations.",
  "frontend/src/components/utilities/GravityGunControl.tsx": "Provides a control panel for toggling and supercharging a gravity gun device, displaying its status, mode, and charge level with real-time updates via React Query.",
  "frontend/src/components/utilities/MiniAudioPlayer.tsx": "A minimizable audio player component with play/pause, skip, volume controls, and mute functionality positioned at the bottom-right of the screen.",
  "frontend/src/components/vehicles/VehicleStatusPanel.tsx": "Displays vehicle status information including fuel, integrity, speed, engine specifications, and tactical capabilities with color-coded status indicators and optional detailed view.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAutoUiScale.ts": "Hook that automatically calculates and returns a UI scale factor based on viewport dimensions, interpolating between min and max scales for responsive scaling on different screen sizes.",
  "frontend/src/hooks/useHudPresence.ts": "Tracks pointer/touch position and updates CSS custom properties for reactive HUD effects, using requestAnimationFrame throttling for performance optimization.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMarkFeatures.ts": "Hook that returns the active mark feature set based on user settings, selecting between visual and functional mark configurations.",
  "frontend/src/hooks/useMarkGlitchEffects.ts": "Hook that generates random glitch effects (flickering, text corruption, color shifts, scanlines) for Mark I visual style, respecting reduced motion preferences.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating HEV suit stats, module states, gravity gun status, and vehicle data from the backend actor.",
  "frontend/src/hooks/useReducedMotion.ts": "Hook that detects and returns the user's reduced motion preference from system settings via media query.",
  "frontend/src/hooks/useSystemMetrics.ts": "Hook that calculates derived system metrics including system health, power efficiency, module load, and overall status from suit state and hazards.",
  "frontend/src/hooks/useViewportOrientation.ts": "Hook that detects and returns whether the device is in landscape orientation using media queries and resize events.",
  "frontend/src/index.css": "Global CSS with Tailwind setup, OKLCH color system for light/dark themes, faction-specific color schemes, and HUD-specific component styles with animations.",
  "frontend/src/lib/characterBackstories.ts": "Character backstory data and lookup function for Half-Life characters including Gordon Freeman, Barney Calhoun, Alyx Vance, and scientists with biographies, roles, and achievements.",
  "frontend/src/lib/commands.ts": "Implements a command-line interface for controlling H.E.V. suit parameters (health, armor, aux power, ammo), toggling modules, setting hazard levels, and changing display modes with commands like /help, /status, /health, /module, etc.",
  "frontend/src/lib/equipmentData.ts": "Defines equipment module data structures and an array of H.E.V. suit modules (helmet, respirator, radiation shield, long jump, medical systems, etc.) with specifications, capabilities, and operational notes for each.",
  "frontend/src/lib/glyphs.ts": "Exports monochrome Unicode symbols for HUD display including hazard indicators (fire, bio, radiation, electrical, gas), status symbols (warning, critical, nominal), and directional arrows.",
  "frontend/src/lib/markFeatureSets.ts": "Defines feature availability for each H.E.V. Mark (I through V) including which stats, panels, tabs, modules, and advanced features are enabled, with Mark I being most basic and Mark V having all features.",
  "frontend/src/lib/markThemes.ts": "Defines visual themes for each H.E.V. Mark and a prototype variant, specifying color palettes (HSL values), characteristics, and visual styles (industrial/combat/hybrid) with Mark IV being hazmat-focused and Mark V being combat-optimized.",
  "frontend/src/lib/suitLoreData.ts": "Contains lore sections describing the H.E.V. suit's development history, Mark series evolution, Black Mesa context, manufacturer details, notable incidents (Gordon Freeman), technical specifications, and operational doctrine.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker for PWA functionality by listening for the window load event and registering '/service-worker.js' if the browser supports service workers.",
  "frontend/src/state/audioState.ts": "Zustand store managing audio playback state with playlist management, play/pause/stop/next/previous controls, loop toggle, volume control, and support for adding custom audio tracks via file upload.",
  "frontend/src/state/hazardAlerts.ts": "Monitors hazard levels and triggers critical flashing alerts and voice warnings when any hazard exceeds 80%, with throttled alerts every 5 seconds.",
  "frontend/src/state/hazardsState.ts": "Zustand store managing five environmental hazard types (fire, bio, radiation, electrical, gas) with methods to set levels, calculate aggregate hazard, and determine status labels.",
  "frontend/src/state/infoSettingsState.ts": "Empty file with no content.",
  "frontend/src/state/infoSettingsStore.ts": "Persisted Zustand store managing comprehensive UI settings including system style, display mode, HEV mark, faction switching, voice/AI toggles, and computed properties for theme states.",
  "frontend/src/state/suitState.ts": "Zustand store tracking suit stats (health, armor, aux, ammo, hazard), module toggles, damage events with directional indicators, and threshold checks for critical states.",
  "frontend/src/state/systemLog.ts": "Zustand store managing a rolling log of up to 100 timestamped entries with types (system, module, command, warning, error, hazard, radio, medical).",
  "frontend/src/state/tacticalState.ts": "Zustand store managing tactical information including threat level, mission status, objectives with priorities, waypoints with distance/bearing, and engagement status.",
  "frontend/src/state/uiState.ts": "Simple Zustand store managing landscape mode toggle state for UI layout.",
  "frontend/src/state/weaponSystemsState.ts": "Zustand store tracking selected weapon, ammo type, and fire rate with defaults set to crowbar/melee configuration.",
  "frontend/src/tabs/ArsenalTab.tsx": "Displays faction-specific weapon arsenals with detailed stats (damage, accuracy, fire rate, magazine, range) and lore descriptions for HEV, HECU, security, and Combine factions.",
  "frontend/src/tabs/BasicsTab.tsx": "Main HUD tab displaying health, armor, aux power, and ammo meters with critical alerts, voice warnings on threshold crossings, and Mark-specific feature gating and glitch effects.",
  "frontend/src/tabs/CommandBriefingTab.tsx": "Displays a military-themed command briefing interface with chain of command, operation orders (containment, witness elimination, asset recovery), and rules of engagement sections using HECU military styling.",
  "frontend/src/tabs/FacilityMonitoringTab.tsx": "Shows Black Mesa facility security monitoring with sector status grid, surveillance camera feeds, and access control panels displaying lock states and clearance levels.",
  "frontend/src/tabs/HazardsTab.tsx": "Displays environmental hazard monitoring (fire, bio, radiation, electrical, gas) with aggregate levels, trend analysis, and protection system status; adapts titles based on system style (HECU/security/default).",
  "frontend/src/tabs/HevTab.tsx": "Renders H.E.V. suit hazard systems tab with contamination monitoring, radiation analysis, and environmental protection panels organized in a tactical layout.",
  "frontend/src/tabs/InfoTab.tsx": "Displays comprehensive system information including operator profile, character backstory, suit subsystems, equipment descriptions, system logs, and command console; adapts subsystem titles based on system style.",
  "frontend/src/tabs/MainTab.tsx": "Shows main dashboard with critical stats grid (health, armor, aux power, ammo) and environmental hazards overview, using color-coded status indicators based on value thresholds.",
  "frontend/src/tabs/MedicalTab.tsx": "Displays medical readouts and interactive panels for Mark III+ suits; shows unavailable message for Mark I/II with feature gating based on suit capabilities.",
  "frontend/src/tabs/MilitaryTab.tsx": "Renders military operations interface with advanced tactical systems, weapons specifications, and squad status panels in a tactical grid layout.",
  "frontend/src/tabs/ObjectivesTab.tsx": "Displays faction-specific mission objectives with priority levels, status tracking, location data, and rewards. Allows toggling objective completion status and shows different objectives for HEV, HECU, and Security factions.",
  "frontend/src/tabs/ResearchLabTab.tsx": "Presents Black Mesa research database content including experiment logs, anomalous materials data, Xen specimen classifications, and teleportation technology information in an accordion-style interface.",
  "frontend/src/tabs/SecurityTab.tsx": "Displays security operations interface with facility map, surveillance camera grid, and access control panels for monitoring Black Mesa facility.",
  "frontend/src/tabs/SettingsTab.tsx": "Comprehensive settings panel for configuring voice, HUD opacity, UI scale, display mode, faction/system style, operator name, and system reset options. Includes PWA installation prompt and keyboard shortcuts dialog.",
  "frontend/src/tabs/SystemsDiagnosticsTab.tsx": "Shows real-time system diagnostics including power management, module status, power consumption breakdown, and system health metrics with progress bars and status indicators.",
  "frontend/src/tabs/TacticalTab.tsx": "Displays tactical information with radar panel, threat assessment panel, and mission briefing display in a grid layout.",
  "frontend/src/tabs/UtilitiesTab.tsx": "Provides controls for toggling HEV suit modules (flashlight, helmet, respirator, long jump, etc.), audio controls (ambience and radio), and gravity gun control. Filters available modules based on mark features.",
  "frontend/src/tabs/VehiclesTab.tsx": "Fetches and displays vehicle status information in a grid layout using VehicleStatusPanel components, with loading and error states.",
  "frontend/src/tabs/WeaponsTab.tsx": "Defines the WeaponsTab component displaying Half-Life 1 weapons arsenal with detailed stats (damage, fire rate, accuracy, etc.), collapsible weapon cards, technical specifications, lore descriptions, and faction-specific styling using badges and progress bars.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system for faction themes (HECU, Security, Resistance), custom border widths, letter spacing, and plugins for animations and typography.",
  "project_state.json": "Project state document defining a multi-faction Half-Life HUD system with four factions (H.E.V, HECU, Security, Combine), architectural notes on React/TypeScript/Vite stack, known black screen issue to fix, required faction logos and map images, and extensive feature list including tactical displays, weapons, medical diagnostics, and music player."
}