{
  "backend/main.mo": "Defines a canister actor with suit stats, module toggles, environmental hazard structures, and system state records with initial values.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requirements to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of all major frontend files describing UI layout, tabs, HUD components, state stores, and utilities.",
  "frontend/index.css": "Sets global Tailwind base styles and defines light/dark theme CSS variables for the HUD interface.",
  "frontend/index.html": "HTML entry point containing the root mount node and script loader for the React app.",
  "frontend/src/App.tsx": "Main React app handling boot sequence, display modes, tab navigation, and tactical mode safety logic.",
  "frontend/src/audio/audioBus.ts": "Implements a centralized audio bus for SFX and voice playback with unlock logic for browser autoplay restrictions.",
  "frontend/src/audio/hevVoice.ts": "Provides HEV-style voice announcement helpers that trigger audio cues based on system and module events.",
  "frontend/src/audio/uiSfx.ts": "Provides helper functions to play various UI sound effects when voice is enabled.",
  "frontend/src/components/audio/AmbiencePlayer.tsx": "Implements an ambience audio player with playlist controls, volume, looping, and custom track uploads.",
  "frontend/src/components/boot/BootSequenceOverlay.tsx": "Runs a staged boot-up animation with typed text, audio cues, and a fade-out before signaling completion.",
  "frontend/src/components/hazards/EnvironmentalHazardsPanel.tsx": "Displays environmental hazard levels with icons, labels, and status-based styling.",
  "frontend/src/components/hud/HudGlobalEffects.tsx": "Renders global HUD visual effects like bloom, critical overlay, and presence glow with reduced-motion support.",
  "frontend/src/components/hud/HudLayout.tsx": "Defines the main HUD container with theming, orientation handling, effects, and header/footer structure.",
  "frontend/src/components/hud/HudOfflineOverlay.tsx": "Shows an overlay indicating the HUD system is offline with guidance to restore it.",
  "frontend/src/components/hud/MinimalHudView.tsx": "Renders a minimal HUD showing key stats and a button to restore the full HUD mode.",
  "frontend/src/components/hud/Panels.tsx": "Contains reusable HUD panel components including stat panels, meter panels, and vitals display.",
  "frontend/src/components/hud/TacticalHudShell.tsx": "Wraps the tactical HUD layout, showing system readouts and stat panels while injecting child content in the center.",
  "frontend/src/components/hud/TacticalOverlay.tsx": "Renders a standalone tactical overlay with frames, a reticle, and fixed system readout labels.",
  "frontend/src/components/info/CommandConsole.tsx": "Implements an interactive command console with history navigation, command execution, and log updates.",
  "frontend/src/components/info/ConfirmActionModal.tsx": "Provides a confirmation dialog with customizable text and sound effects for confirm/cancel actions.",
  "frontend/src/components/info/SuitSubsystemReadouts.tsx": "Displays subsystem statuses and toggles suit settings, with confirmations and log entries for critical actions.",
  "frontend/src/components/info/SystemLogView.tsx": "Shows timestamped system log entries inside a scrollable area.",
  "frontend/src/components/medical/MedicalDiagram.tsx": "Displays a medical diagram image with colored overlays reflecting health and armor values.",
  "frontend/src/components/medical/MedicalReadouts.tsx": "Generates detailed medical stats and assessments based on suit and hazard state values.",
  "frontend/src/components/tactical/RadarPanel.tsx": "Canvas radar component that animates a sweep line and draws deterministic contacts with visual effects.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages a backend actor tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useHudPresence.ts": "Tracks pointer and touch activity to update CSS variables for HUD effects using throttled animation frames.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, storing identity, and exposing login state and helpers.",
  "frontend/src/hooks/useQueries.ts": "Set of React Query hooks for fetching and mutating stats and module states through the backend actor.",
  "frontend/src/hooks/useReducedMotion.ts": "Detects the user's prefers‑reduced‑motion setting and returns a boolean.",
  "frontend/src/hooks/useViewportOrientation.ts": "Detects whether the viewport is in landscape orientation using matchMedia and resize/orientation listeners.",
  "frontend/src/index.css": "Global Tailwind and custom CSS defining theme variables, animations, HUD styles, and interaction behaviors.",
  "frontend/src/lib/commands.ts": "Parses text commands to modify suit, hazard, and info settings state, logging actions and returning status messages.",
  "frontend/src/lib/glyphs.ts": "Defines a set of monochrome Unicode glyphs for hazard and status indicators.",
  "frontend/src/lib/weaponsData.ts": "Provides interfaces and a dataset describing melee, ranged, and magic weapons with stats, ammo, and fire-rate options.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider, rendering the main App component.",
  "frontend/src/state/audioState.ts": "Zustand store managing audio playback, playlist handling, volume, looping, and custom track uploads.",
  "frontend/src/state/hazardAlerts.ts": "Monitors hazard levels to trigger critical flashing and voice alerts with throttling.",
  "frontend/src/state/hazardsState.ts": "Zustand store tracking individual hazard levels with utilities for aggregate status and reset.",
  "frontend/src/state/infoSettingsState.ts": "Manages HUD and info settings including display mode, voice, color scheme, and UI scaling.",
  "frontend/src/state/suitState.ts": "Zustand store for suit stats and module toggles with setters and reset functionality.",
  "frontend/src/state/systemLog.ts": "Provides a log store for timestamped system entries with add and clear operations.",
  "frontend/src/state/uiState.ts": "Stores and toggles UI landscape mode state with reset support.",
  "frontend/src/state/weaponSystemsState.ts": "Tracks selected weapon, ammo type, and fire rate with simple setters and reset.",
  "frontend/src/tabs/BasicsTab.tsx": "Renders core suit stats, hazards, and vitals panels using current suit state.",
  "frontend/src/tabs/HazardsTab.tsx": "Renders hazard monitoring UI with filtering, trends, environmental stats, and expandable hazard details using store data.",
  "frontend/src/tabs/InfoTab.tsx": "Displays subsystem readouts, system logs, and a command console in structured panels.",
  "frontend/src/tabs/MedicalTab.tsx": "Shows medical system readouts via the MedicalReadouts component.",
  "frontend/src/tabs/SettingsTab.tsx": "Provides UI and system configuration controls, including display mode, HUD settings, voice, and system reset.",
  "frontend/src/tabs/TacticalTab.tsx": "Shows tactical radar, readouts, and contact list within HUD panels.",
  "frontend/src/tabs/UtilitiesTab.tsx": "Manages suit module toggles and ambience playback with audio feedback.",
  "frontend/src/tabs/WeaponsTab.tsx": "Displays weapon loadouts, selection UI, and detailed stats for the chosen weapon.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, borders, typography, and plugin integrations.",
  "project_state.json": "Defines the project’s metadata, required weapon images, architectural notes, and lists existing and new feature requests focused on expanding and organizing the Weapons tab’s static frontend data and UI."
}