{
  "backend/main.mo": "Defines a canister actor with suit stats, module toggles, environmental hazard systems, life support, and related system state structures.",
  "backend/migration.mo": "Provides a migration function copying module toggle values from an old actor structure to a new one.",
  "feature_evidence.json": "Describes feature evidence linking frontend files to maintaining stable module toggle UI behavior via backend-refetched state.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for reference or tooling.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for light/dark themes and HUD color styling.",
  "frontend/index.html": "HTML entry point setting meta tags, PWA icons, manifest, and root mounting point.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, icons, and display settings.",
  "frontend/public/service-worker.js": "Service worker implementing caching, cache versioning, fetch handling, and offline fallback.",
  "frontend/src/App.tsx": "Main React app managing boot sequence, tab routing, display modes, backend module-state syncing, and service worker registration.",
  "frontend/src/audio/audioBus.ts": "Audio bus utility handling UI SFX and voice playback with audio unlock logic and fallback safety.",
  "frontend/src/audio/hevVoice.ts": "Provides HEV-style voice playback helpers triggered by suit events, gated by the voiceEnabled setting.",
  "frontend/src/audio/uiSfx.ts": "Plays UI sound effects for tab switches, toggles, and other interactions when voiceEnabled is active.",
  "frontend/src/components/audio/AmbiencePlayer.tsx": "A UI audio player for ambient tracks with playback controls, looping, volume, and custom track uploads.",
  "frontend/src/components/boot/BootSequenceOverlay.tsx": "Runs a staged boot animation with typing effects, sound cues, fade-out, and a completion callback.",
  "frontend/src/components/common/HudSwitch.tsx": "A thin wrapper around a Switch component adding HUD-specific styling.",
  "frontend/src/components/hazards/EnvironmentalHazardsPanel.tsx": "Displays hazard levels with icons and status classes based on readings from the hazards store.",
  "frontend/src/components/hud/HudGlobalEffects.tsx": "Renders global HUD visual effects including bloom, critical overlay, and presence glow with reduced-motion support.",
  "frontend/src/components/hud/HudLayout.tsx": "Main HUD container applying color scheme, scaling, orientation logic, global effects, and header/footer layout.",
  "frontend/src/components/hud/HudOfflineOverlay.tsx": "Shows a warning overlay indicating the HUD system is offline with instructions to restore it.",
  "frontend/src/components/hud/HudTabsBar.tsx": "Enhanced tabs bar showing category icons and status indicators derived from suit, hazards, weapons, and settings state.",
  "frontend/src/components/hud/MinimalHudView.tsx": "Renders a minimal HUD with stat panels and a button to restore the standard display mode, updating logs and playing audio cues.",
  "frontend/src/components/hud/Panels.tsx": "Provides reusable HUD panel components including generic, stat, meter, and vitals panels with styling and status logic.",
  "frontend/src/components/hud/TacticalHudShell.tsx": "Defines the tactical HUD layout with sidebars, reticle, and embedded stat panels while rendering child content in the center.",
  "frontend/src/components/hud/TacticalOverlay.tsx": "Displays an always-on-screen tactical overlay with frames, reticle, and various static readout elements.",
  "frontend/src/components/info/CommandConsole.tsx": "Implements an interactive command console with history, execution handling, logging, and keyboard navigation.",
  "frontend/src/components/info/ConfirmActionModal.tsx": "Provides a confirmation dialog wrapper triggering sound effects and callbacks on confirm or cancel.",
  "frontend/src/components/info/OperatorProfilePanel.tsx": "Shows static operator identity and suit profile details in a styled HUD panel.",
  "frontend/src/components/info/SuitSubsystemReadouts.tsx": "Displays suit subsystem statuses with toggles for HUD, radio, voice, and display mode, using confirmation prompts and logging.",
  "frontend/src/components/info/SystemLogView.tsx": "Renders the system log with timestamps and types inside a scrollable view.",
  "frontend/src/components/medical/MedicalDiagram.tsx": "Renders a medical diagram image with colored overlays showing head, torso, and arm status based on health and armor values.",
  "frontend/src/components/medical/MedicalInteractivePanels.tsx": "Provides interactive medical panels with neural stats and toggleable advanced medical systems, updating logs and suit state.",
  "frontend/src/components/medical/MedicalReadouts.tsx": "Displays vital signs and trauma metrics derived from suit stats and hazard levels, with dynamic health-based calculations.",
  "frontend/src/components/medical/panels/EmergencySosPanel.tsx": "Implements an SOS control panel with arming, spoofing, and test-burst actions, updating system logs and displaying beacon status.",
  "frontend/src/components/medical/panels/LimbIntegrityPanel.tsx": "Shows integrity, load, and calibration state for each limb, allowing calibration toggling and logging changes.",
  "frontend/src/components/tactical/RadarPanel.tsx": "Draws an animated radar sweep with deterministic contacts on a canvas and displays basic range info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to internet identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAutoUiScale.ts": "Provides a hook that computes a responsive UI scale based on viewport width and updates on resize and orientation changes.",
  "frontend/src/hooks/useHudPresence.ts": "Tracks pointer/touch presence and updates CSS variables for reactive HUD effects using requestAnimationFrame.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for managing authentication state, login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps react-query hooks for fetching and updating suit stats and module states, including optimistic updates.",
  "frontend/src/hooks/useReducedMotion.ts": "Detects the user's reduced‑motion preference via matchMedia and returns a boolean.",
  "frontend/src/hooks/useViewportOrientation.ts": "Determines whether the viewport is in landscape orientation and updates on orientation or size changes.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, HUD color palettes, CSS variables, and custom switch styling.",
  "frontend/src/lib/commands.ts": "Parses console-style commands to update suit stats, hazards, modules, system settings, and logs responses.",
  "frontend/src/lib/glyphs.ts": "Exports a set of text‑safe glyphs for hazards, indicators, and directional symbols.",
  "frontend/src/main.tsx": "Initializes React root with React Query and InternetIdentityProvider and renders App.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker on window load and logs success or failure.",
  "frontend/src/state/audioState.ts": "Zustand audio store managing playlist, playback controls, volume, looping, and custom tracks.",
  "frontend/src/state/hazardAlerts.ts": "Monitors hazard levels periodically to trigger critical flashing and throttled voice alerts.",
  "frontend/src/state/hazardsState.ts": "Zustand store tracking individual hazard levels with helpers for aggregate level and status.",
  "frontend/src/state/infoSettingsState.ts": "Zustand store for UI, HUD, voice, and display settings with update actions and reset.",
  "frontend/src/state/suitState.ts": "Zustand store holding suit stats and module states with setters, toggles, and reset.",
  "frontend/src/state/systemLog.ts": "Zustand log store supporting adding timestamped entries and clearing the log.",
  "frontend/src/state/uiState.ts": "Zustand store for toggling landscape mode and resetting UI state.",
  "frontend/src/state/weaponSystemsState.ts": "Zustand store managing selected weapon, ammo type, and fire rate with reset.",
  "frontend/src/tabs/BasicsTab.tsx": "Renders core suit statistics, environmental hazards panel, and vitals overview.",
  "frontend/src/tabs/HazardsTab.tsx": "Displays detailed hazard breakdowns, trends, filters, and environmental statistics.",
  "frontend/src/tabs/InfoTab.tsx": "Shows operator profile, subsystem readouts, system log, and command console panels.",
  "frontend/src/tabs/MedicalTab.tsx": "Renders medical readouts and interactive medical control panels.",
  "frontend/src/tabs/SettingsTab.tsx": "Provides UI to modify HUD, voice, system, and suit settings and perform system reset.",
  "frontend/src/tabs/TacticalTab.tsx": "Renders the tactical HUD tab with radar, readouts, and a static contact list using various HUD components.",
  "frontend/src/tabs/UtilitiesTab.tsx": "Displays module toggle controls and an ambience player, using backend module state and toggle mutations with audio feedback.",
  "frontend/src/tabs/WeaponsTab.tsx": "Provides a weapons tab with selectable weapons and collapsible details sourced from a static weapon dataset.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, spacing, and plugins for the frontend UI.",
  "project_state.json": "Project state file describing issue context, known problems, and a pending feature request for backend module state persistence."
}