{
  "backend/main.mo": "Motoko actor defining HEV suit backend with types for stats, modules, hazards, life support, power management, and AI communication; manages suit state, environmental hazards, and system status with query/update methods.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: female TTS voice narration for boot sequence and enhanced boot sequence visuals with status indicators and progress bars.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, including App, HUD layout, tabs (Basics, Medical, Info, Utilities, Weapons, Settings), boot sequence, state stores (Zustand), and audio systems.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes defining colors for background, foreground, primary, secondary, borders, and HUD-specific design tokens.",
  "frontend/index.html": "HTML entry point with PWA meta tags, viewport configuration for mobile, manifest link, and icons for H.E.V Mark V Prototype HUD application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, display mode (standalone), theme colors, and orientation settings for H.E.V HUD progressive web app.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for app shell resources with offline fallback and automatic cache cleanup on activation.",
  "frontend/src/App.tsx": "Main React component orchestrating boot sequence, display mode routing (MINIMAL/TACTICAL), tab management, backend module state synchronization to Zustand, service worker registration, and HUD tab navigation with audio feedback.",
  "frontend/src/audio/audioBus.ts": "Central audio bus managing AudioContext, SpeechSynthesis for HEV boot sequence narration with female voice selection, and methods for playing UI sound effects and voice clips with safe fallbacks.",
  "frontend/src/audio/hevVoice.ts": "Helper functions for triggering HEV-style voice announcements (module enabled/disabled, health critical, hazard detected, etc.) that check voice settings before playing audio files via audioBus.",
  "frontend/src/audio/uiSfx.ts": "UI sound effect helpers for common interactions (tab switch, toggle, console submit, button clicks) that check voice settings before playing audio via audioBus.",
  "frontend/src/components/audio/AmbiencePlayer.tsx": "Audio player component with playback controls (play/pause/skip), volume slider, loop toggle, and custom track upload functionality using audioState store.",
  "frontend/src/components/boot/BootSequenceOverlay.tsx": "Boot sequence overlay component that displays progressive system initialization stages with CRT effects, plays boot sounds, triggers optional voice narration, and fades out on completion.",
  "frontend/src/components/common/HudSwitch.tsx": "Wrapper component for Switch UI element with HUD-specific styling and standard switch props (checked, disabled, onChange).",
  "frontend/src/components/hazards/EnvironmentalHazardsPanel.tsx": "Panel displaying five environmental hazard types (fire, bio, radiation, electrical, gas) with icons, levels, and status classes (nominal/warning/critical) from hazardsState.",
  "frontend/src/components/hud/HudGlobalEffects.tsx": "Renders non-interactive visual effect overlays (bloom, critical flash, presence glow) with reduced motion support for accessibility.",
  "frontend/src/components/hud/HudLayout.tsx": "Main HUD container component managing layout, color schemes, landscape/compact modes, UI scaling, CRT/scanline overlays, header/footer with branding, and global effects integration.",
  "frontend/src/components/hud/HudOfflineOverlay.tsx": "Overlay component displaying a warning message when HUD system is disabled, prompting user to restore HUD status in INFO tab.",
  "frontend/src/components/hud/HudTabsBar.tsx": "Renders a tabbed navigation bar for the HUD with tabs for Basics, Medical, Info, Utilities, Weapons, Hazards, Tactical, and Settings. Each tab displays real-time status indicators (health, armor, active modules, hazard levels, etc.) pulled from various state stores.",
  "frontend/src/components/hud/MinimalHudView.tsx": "Displays a minimal HUD view showing only essential stats (health, armor, aux power, ammo) in a grid layout with a button to restore the full standard HUD display.",
  "frontend/src/components/hud/Panels.tsx": "Provides reusable panel components (HudPanel, StatPanel, MeterPanel, VitalsPanel) for displaying labeled stats with progress bars and status indicators (nominal/warning/critical).",
  "frontend/src/components/hud/TacticalHudShell.tsx": "Wraps content in a tactical HUD layout with top/bottom bars and left/right sidebars displaying combat system status, threat analysis, heart rate, targeting info, and compact stat panels.",
  "frontend/src/components/hud/TacticalOverlay.tsx": "Renders a full-screen tactical overlay with corner frames, center reticle, and multiple readout panels showing combat mode, threat level, targeting, heart rate, enemy locator, and other militarized system statuses.",
  "frontend/src/components/info/CommandConsole.tsx": "Implements an interactive command console with input field, command history, arrow key navigation, and execution of commands via executeCommand function with audio feedback.",
  "frontend/src/components/info/ConfirmActionModal.tsx": "Displays a confirmation dialog modal with customizable title, description, and confirm/cancel actions that trigger audio feedback on user interaction.",
  "frontend/src/components/info/OperatorProfilePanel.tsx": "Shows operator profile information including name (Leon Krywiak), clearance level, suit serial number, neural link status, biometric verification, and current mission time.",
  "frontend/src/components/info/SuitSubsystemReadouts.tsx": "Displays life support, environmental protection, and power systems with interactive toggles for voice, radio, HUD, and display modes; includes confirmation modals for critical actions.",
  "frontend/src/components/info/SystemLogView.tsx": "Renders a scrollable system log displaying timestamped entries with type-based styling (system, warning, error).",
  "frontend/src/components/medical/MedicalDiagram.tsx": "Displays a schematic H.E.V. suit diagram with color-coded overlays for head, torso, and arms based on health and armor values.",
  "frontend/src/components/medical/MedicalInteractivePanels.tsx": "Provides interactive medical panels including limb integrity, emergency SOS, neural interface status, and toggleable advanced medical systems (pain suppression, auto-stim, nano-repair).",
  "frontend/src/components/medical/MedicalReadouts.tsx": "Displays vital signs (heart rate, blood pressure, respiration) and trauma assessment metrics derived from suit health, armor, and hazard levels.",
  "frontend/src/components/medical/panels/EmergencySosPanel.tsx": "Emergency SOS panel with arming system, signal spoofing toggle, test burst transmission, and status monitoring for distress beacon.",
  "frontend/src/components/medical/panels/LimbIntegrityPanel.tsx": "Monitors individual limb integrity, servo load, fracture probability, and calibration status with toggleable calibration controls for each limb.",
  "frontend/src/components/tactical/RadarPanel.tsx": "React component that renders an animated radar display on a canvas, showing friendly/hostile/unknown contacts with a sweeping scan line and range rings.",
  "frontend/src/hooks/useActor.ts": "Hook that manages the ICP actor instance with authentication, creating actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAutoUiScale.ts": "Hook that calculates and returns a responsive UI scale factor based on viewport dimensions, interpolating between min and max scales for mobile and tablet screens.",
  "frontend/src/hooks/useHudPresence.ts": "Hook that tracks pointer/touch position and updates CSS custom properties (--pointer-x, --pointer-y, --pointer-intensity) using requestAnimationFrame for performance-optimized reactive effects.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching stats and module states from the backend actor, plus mutations for updating stats and toggling modules with optimistic updates.",
  "frontend/src/hooks/useReducedMotion.ts": "Hook that detects and returns the user's prefers-reduced-motion media query preference for accessibility-aware animations.",
  "frontend/src/hooks/useViewportOrientation.ts": "Hook that detects and returns whether the device is in landscape orientation using matchMedia and resize/orientationchange events.",
  "frontend/src/index.css": "Main stylesheet defining Tailwind layers, OKLCH color system with orange/red palette, CRT overlay effects, scanlines, and compact HUD panel styling for a retro sci-fi interface.",
  "frontend/src/lib/commands.ts": "Command-line interface implementation for controlling suit stats, hazards, modules, and system settings via slash commands like /health, /armor, /hazard, and /module.",
  "frontend/src/lib/glyphs.ts": "Exports Unicode text-variant symbols for hazards (fire, bio, radiation, electrical, gas) and status indicators to ensure monochrome HUD-safe rendering.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker for PWA functionality on window load if supported by the browser.",
  "frontend/src/state/audioState.ts": "Zustand store managing audio playlist, playback controls (play/pause/next/previous), volume, loop mode, and custom track uploads with default ambience tracks.",
  "frontend/src/state/hazardAlerts.ts": "Monitors hazard levels and triggers critical flashing alerts with throttled voice warnings when any hazard exceeds 80%.",
  "frontend/src/state/hazardsState.ts": "Zustand store tracking five environmental hazard types (fire, bio, radiation, electrical, gas) with aggregate calculation and status determination.",
  "frontend/src/state/infoSettingsState.ts": "Zustand store for UI settings including voice toggle, display mode, radio link, HUD color scheme, UI scale, and tactical mode preferences.",
  "frontend/src/state/suitState.ts": "Zustand store managing suit statistics (health, armor, aux, ammo, hazard) and module activation states with validation and reset functionality.",
  "frontend/src/state/systemLog.ts": "Zustand store for system log entries with typed messages (system, module, command, warning, error, hazard) and timestamps.",
  "frontend/src/state/uiState.ts": "Zustand store managing landscape mode toggle state for UI layout adaptation.",
  "frontend/src/state/weaponSystemsState.ts": "Zustand store tracking selected weapon, ammo type, and fire rate with default crowbar/melee configuration.",
  "frontend/src/tabs/BasicsTab.tsx": "Renders the Basics tab with core statistics panel (health, armor, aux, ammo), environmental hazards panel, and vitals panel with status thresholds.",
  "frontend/src/tabs/HazardsTab.tsx": "Displays environmental hazard monitoring with expandable panels for fire, bio, radiation, electrical, and gas hazards, including trend indicators, statistics, and atmospheric readouts.",
  "frontend/src/tabs/InfoTab.tsx": "Renders the info tab layout with operator profile, suit subsystem readouts, system log view, and command console components.",
  "frontend/src/tabs/MedicalTab.tsx": "Displays medical monitoring interface with medical readouts and interactive panels for health management.",
  "frontend/src/tabs/SettingsTab.tsx": "Provides settings controls for voice, display mode, HUD, color scheme, UI scale, and system reset with audio feedback integration.",
  "frontend/src/tabs/TacticalTab.tsx": "Shows tactical information including radar panel, combat readouts (heart rate, threat level), and contact list with friendly/hostile indicators.",
  "frontend/src/tabs/UtilitiesTab.tsx": "Manages suit module toggles (helmet, respirator, flashlight, etc.) with backend integration and includes an ambience audio player.",
  "frontend/src/tabs/WeaponsTab.tsx": "Displays detailed weapon information with selectable ammo types and fire rates, showing capabilities, lore, and tactical use cases for each weapon.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors using OKLCH color space, border utilities, tactical letter spacing, and animation plugins.",
  "project_state.json": "Project state file for H.E.V Mark Prototype protective systems interface tracking two completed features: female text-to-speech voice narration for boot sequence and enhanced visual boot sequence with system initialization stages. Contains architectural notes about TTS voice system and multi-stage boot visualization."
}