{
  "backend/main.mo": "Main actor defining comprehensive HUD state including stats, hazards, life support, power management, vehicles, factions, weapons, and modules with query/update methods for all systems and faction-specific weapon arsenals.",
  "backend/migration.mo": "Migration module duplicating all type definitions from main.mo and providing a run() function to initialize/migrate stable state with default values for all HUD systems.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including faction color schemes, weapon arsenals, boot sequence enhancements, tab interactions, and quality-of-life improvements with file/component mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing App.tsx with keyboard shortcuts, HUD panels with visual polish, boot sequence with 12 stages, tabs for medical/weapons/settings, and utility components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes defining colors for background, foreground, primary, secondary, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with PWA meta tags, theme color, viewport configuration, manifest link, and icon references for mobile/desktop installation.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons (192x192 and 512x512 with maskable variants), display mode as standalone, theme colors, and orientation settings.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for core assets and runtime caching for network requests, with install/activate/fetch event handlers for offline support.",
  "frontend/src/App.tsx": "Main application component that sets up React Query, manages boot sequence, tab navigation, display modes (standard/minimal/tactical/emergency), keyboard shortcuts, and syncs backend module state with Zustand store.",
  "frontend/src/audio/audioBus.ts": "Central audio bus class that manages AudioContext initialization, autoplay unlocking, and provides methods for playing UI sound effects, HEV voice announcements, alert sequences, and layered audio.",
  "frontend/src/audio/hevVoice.ts": "HEV-style voice announcement helpers that check voice settings and trigger audio playback for module state changes, health/armor warnings, hazards, stat changes, and system events.",
  "frontend/src/audio/uiSfx.ts": "UI sound effects helpers that check voice settings and play audio for common interactions like tab switching, toggles, console commands, button clicks, and confirmations.",
  "frontend/src/components/audio/AmbiencePlayer.tsx": "Audio player component with playback controls, volume slider, loop toggle, and custom track upload functionality using Zustand audio store.",
  "frontend/src/components/audio/RadioControlPanel.tsx": "Radio communications panel with frequency tuning, channel selection, signal strength display, message broadcasting, and transmission history that varies by faction style.",
  "frontend/src/components/boot/BootSequenceOverlay.tsx": "Boot sequence overlay that displays staged initialization progress with faction-specific labels, glitch effects, and completion callback.",
  "frontend/src/components/common/HudDivider.tsx": "Simple HUD divider component with optional decorative corners and styling.",
  "frontend/src/components/common/HudSection.tsx": "Reusable HUD section component with optional title, collapsible functionality, and custom styling.",
  "frontend/src/components/common/HudSwitch.tsx": "Wrapper component for Switch UI element with HUD-specific styling and standard switch props.",
  "frontend/src/components/common/HudTooltip.tsx": "A reusable tooltip component wrapper that uses shadcn/ui Tooltip with configurable side positioning and delay duration.",
  "frontend/src/components/hazards/EnvironmentalHazardsPanel.tsx": "Displays a vertical list of environmental hazards (fire, bio, radiation, electrical, gas) with progress bars, status indicators, and severity-based styling.",
  "frontend/src/components/hazards/HorizontalHazardPanel.tsx": "Renders environmental hazards in a horizontal grid layout with compact labels, icons, progress bars, and severity classes.",
  "frontend/src/components/hev/ContaminationMonitorPanel.tsx": "Shows contamination monitoring data including exposure levels, decontamination status, airborne hazard analysis, and suit breach warnings.",
  "frontend/src/components/hev/EnvironmentalProtectionPanel.tsx": "Displays environmental protection system status including respirator, hazmat seal, temperature regulation, and atmospheric composition data.",
  "frontend/src/components/hev/RadiationAnalysisPanel.tsx": "Shows radiation dosimeter readings, accumulated dose, isotope identification, shielding effectiveness, and safe exposure time calculations.",
  "frontend/src/components/hud/CriticalStatAlert.tsx": "Wrapper component that adds a pulsing colored border and shadow around child elements when critical thresholds are reached, with reduced motion support.",
  "frontend/src/components/hud/DamageIndicator.tsx": "Displays a directional red gradient flash overlay when damage is taken, with auto-dismiss timer and reduced motion support.",
  "frontend/src/components/hud/EmergencyModeView.tsx": "Full-screen emergency mode interface showing critical vitals, hazards, emergency controls (pain suppression, auto-stimulant), and SOS panel with exit functionality.",
  "frontend/src/components/hud/EnhancedStatusIndicators.tsx": "Displays dynamic status badges (shield boost, hazards, low ammo, critical health, radio offline) with tooltips based on suit stats, hazards, and system state.",
  "frontend/src/components/hud/FactionLayoutWrapper.tsx": "Wrapper component that applies faction-specific CSS layout classes (HEV, HECU, Guard, Resistance) based on system style settings.",
  "frontend/src/components/hud/HudGlobalEffects.tsx": "Renders non-interactive visual overlays including bloom, critical state flash, presence glow, and HL1 scanlines, respecting reduced motion preferences.",
  "frontend/src/components/hud/HudLayout.tsx": "Main HUD container that orchestrates layout, applies Mark theme CSS variables, manages auto-scaling, and renders header with faction name and operator info.",
  "frontend/src/components/hud/HudOfflineOverlay.tsx": "Displays a warning overlay when the HUD system is disabled, prompting user to restore it via the INFO tab.",
  "frontend/src/components/hud/HudTabsBar.tsx": "Renders the main navigation tabs bar with icons, shortcuts, micro-indicators for warnings, and an emergency mode button, filtered by Mark feature availability.",
  "frontend/src/components/hud/LowAmmoWarning.tsx": "Shows a pulsing yellow alert icon and text when ammunition drops below 20%, respecting reduced motion preferences.",
  "frontend/src/components/hud/MarkIGlitchOverlay.tsx": "Renders visual glitch effects (flickering, scanline sweep, color shift) specifically for Mark I HEV suit when active.",
  "frontend/src/components/hud/MinimalHudView.tsx": "Provides a simplified HUD display mode showing core stats (health, armor, ammo, aux) with critical warnings, hazard panel, and a button to restore standard view.",
  "frontend/src/components/hud/Panels.tsx": "Exports StatPanel and MeterPanel components with different visual styles (HL1 segmented, HL2 numerical, custom) for displaying stats and meters with status indicators.",
  "frontend/src/components/hud/TacticalHudShell.tsx": "Wraps HUD content with a tactical overlay featuring top bar modules, left/right sidebars with threat/health/armor/comms/power stats, and a center reticle. Only renders tactical UI for Mark III+ suits based on feature flags.",
  "frontend/src/components/hud/TacticalOverlay.tsx": "Renders a full-screen tactical overlay with corner frames, center reticle, and multiple positioned readouts showing combat status, threat level, heart rate, enemy locator, and engagement systems.",
  "frontend/src/components/info/CharacterBackstoryPanel.tsx": "Displays a collapsible operator profile panel showing character biography, role, achievements, and context retrieved from character backstory data based on the selected operator name.",
  "frontend/src/components/info/CommandConsole.tsx": "Implements a terminal-style command console with input history navigation (arrow keys), command execution via executeCommand, scrollable output, and audio feedback for submissions.",
  "frontend/src/components/info/ConfirmActionModal.tsx": "Reusable confirmation dialog component using AlertDialog that plays UI sound effects on confirm/cancel actions and triggers provided callbacks.",
  "frontend/src/components/info/DataVisualization.tsx": "Provides three data visualization components: Sparkline (line chart), RadialGauge (circular progress), and BarChart (horizontal bars with progress indicators).",
  "frontend/src/components/info/EquipmentDescriptionsPanel.tsx": "Displays collapsible equipment module cards showing specifications, capabilities, and operational notes for each H.E.V. suit equipment module from equipmentData.",
  "frontend/src/components/info/OperatorProfilePanel.tsx": "Displays operator profile information including name, designation, clearance level, suit serial, neural link status, biometric ID, and mission time. Adapts labels and designations based on the selected system style (HECU, security, guard, resistance).",
  "frontend/src/components/info/SuitLorePanel.tsx": "Renders a collapsible panel displaying H.E.V. suit lore and history sections from imported suit lore data. Each section can be expanded/collapsed individually.",
  "frontend/src/components/info/SuitSubsystemReadouts.tsx": "Displays suit subsystem status (life support, environmental protection, power, communications, AR display) with interactive toggles for radio link, HUD online, and display mode. Includes confirmation modals for disabling critical systems and triggers audio feedback.",
  "frontend/src/components/info/SystemDiagnosticsPanel.tsx": "Shows real-time system diagnostics including module load, power consumption, system health, and network status with progress bars and status badges. Title adapts based on system style (combat, security, etc.).",
  "frontend/src/components/info/SystemLogView.tsx": "Renders a scrollable system log view displaying timestamped log entries with type and message, pulling data from the system log store.",
  "frontend/src/components/medical/MedicalDiagram.tsx": "Displays a schematic H.E.V. suit diagram with color-coded overlays for head, torso, and arms showing health/armor percentages. Overlay colors change based on status values.",
  "frontend/src/components/medical/MedicalInteractivePanels.tsx": "Provides interactive medical panels including limb integrity, emergency SOS, neural interface status, and advanced medical systems with toggleable controls for pain suppression, auto-stimulant, nano-repair, and bio-monitoring.",
  "frontend/src/components/medical/MedicalReadouts.tsx": "Displays comprehensive medical readouts including vital signs (heart rate, blood pressure, respiration, oxygen), trauma assessment (suit integrity, tissue damage, blood loss), and toxin levels calculated from suit stats and hazard levels.",
  "frontend/src/components/medical/panels/EmergencySosPanel.tsx": "Emergency SOS system panel with arming, test burst transmission, signal spoofing toggle, and status monitoring (beacon, mode, signal integrity). Includes state management for SOS modes (STANDBY/ARMED/TRANSMITTING) and system logging.",
  "frontend/src/components/medical/panels/LimbIntegrityPanel.tsx": "Displays integrity, servo load, fracture probability, and calibration status for four limbs (left/right arm/leg). Allows toggling calibration per limb and updates based on suit health state.",
  "frontend/src/components/military/AdvancedTacticalPanel.tsx": "Tactical information display showing threat assessment, fire support availability, engagement protocols (ROE, OPORD), and tactical overlay data (grid reference, elevation, bearing).",
  "frontend/src/components/military/ExpandedWeaponsPanel.tsx": "Displays detailed weapon specifications for multiple weapons including damage, range, penetration, ammo type, and operational readiness with progress bars.",
  "frontend/src/components/military/SquadStatusPanel.tsx": "Shows squad member status including callsign, role, health, armor, position, and communication status with visual progress bars and status badges.",
  "frontend/src/components/security/AccessControlPanel.tsx": "Access control interface for managing door locks, facility lockdown, and security clearance verification with status indicators for multiple doors and clearance levels.",
  "frontend/src/components/security/FacilityMapPanel.tsx": "Displays an interactive facility map with zoomable controls, sector markers, and vent access points overlaid on a static image. Allows users to select sectors and view their locations on the map.",
  "frontend/src/components/security/SecurityCameraGrid.tsx": "Renders a grid of security camera feeds with status indicators (active/offline/recording), location labels, and cycling functionality. Displays camera thumbnails with selectable focus and real-time status updates.",
  "frontend/src/components/settings/HevMarkSelector.tsx": "Provides a radio group selector for choosing H.E.V. suit marks (Prototype through Mark V) with visual style and functional profile options. Includes a toggle to separate visual styling from functional characteristics.",
  "frontend/src/components/tactical/MissionBriefingDisplay.tsx": "Displays mission objectives with completion status, priority levels, and waypoint navigation data. Shows expandable objective items and adapts title based on system style (HECU/Guard/default).",
  "frontend/src/components/tactical/QuickAccessControls.tsx": "Provides a grid of quick-access toggle buttons for suit modules (flashlight, helmet, respirator, radiation shield, boost, hazard system). Integrates with suit state and plays UI sound effects on interaction.",
  "frontend/src/components/tactical/RadarPanel.tsx": "Renders an animated canvas-based radar display with sweeping scan line, concentric circles, and animated contact markers (friendly/hostile/unknown). Respects reduced motion preferences and shows pulsing, drifting contact indicators.",
  "frontend/src/components/tactical/ThreatAssessmentPanel.tsx": "Displays a threat assessment panel that calculates and visualizes overall threat level based on environmental hazards, suit armor, and operator health, with recommendations based on threat severity.",
  "frontend/src/components/utilities/GravityGunControl.tsx": "Provides UI controls for toggling and supercharging a gravity gun device, displaying its status, mode, and charge level with real-time updates via React Query.",
  "frontend/src/components/vehicles/VehicleStatusPanel.tsx": "Renders a vehicle status panel showing fuel, integrity, speed, engine specifications, and tactical capabilities with color-coded status indicators and optional detailed view.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAutoUiScale.ts": "Calculates and returns a responsive UI scale factor based on viewport dimensions, automatically adjusting between min and max scale values for different screen sizes.",
  "frontend/src/hooks/useHudPresence.ts": "Tracks pointer and touch positions to update CSS custom properties for reactive HUD effects, using requestAnimationFrame for throttled performance optimization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing AuthClient creation, identity persistence, and authentication status throughout the application.",
  "frontend/src/hooks/useMarkFeatures.ts": "Returns the active HEV suit mark feature set based on user settings, supporting separation of visual style from functional features.",
  "frontend/src/hooks/useMarkGlitchEffects.ts": "Custom React hook that generates random glitch effects (flickering, text corruption, color shifts, scanlines, element hiding) for Mark I HEV suit display, respecting reduced motion preferences.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating HEV suit data (stats, modules, gravity gun, vehicles) from the backend actor with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useReducedMotion.ts": "Custom React hook that detects and returns the user's prefers-reduced-motion system preference using matchMedia API.",
  "frontend/src/hooks/useSystemMetrics.ts": "Custom hook that calculates derived system metrics (system health, power efficiency, module load, network connectivity, overall status) from suit stats, modules, and hazard levels.",
  "frontend/src/hooks/useViewportOrientation.ts": "Custom React hook that detects and returns whether the device is in landscape orientation using matchMedia and resize/orientationchange events.",
  "frontend/src/index.css": "Global CSS with Tailwind directives, OKLCH color system variables for light/dark themes, faction-specific color themes (HECU, Security, Resistance), and Mark I glitch effect animations (flicker, scanline, color shift).",
  "frontend/src/lib/characterBackstories.ts": "Defines character backstory data structure and exports detailed biographical information for Half-Life characters (Gordon Freeman, Barney Calhoun, Alyx Vance, Isaac Kleiner, Eli Vance) with roles, achievements, and context.",
  "frontend/src/lib/commands.ts": "Command parser and executor for console commands that manipulate suit stats, hazards, modules, and settings (e.g., /health, /armor, /module, /hazard, /status, /system_restart) with validation and logging.",
  "frontend/src/lib/equipmentData.ts": "Defines equipment module data structures and exports an array of H.E.V. suit equipment modules (helmet, respirator, radiation shield, long jump, medical systems, etc.) with specifications, capabilities, and operational notes.",
  "frontend/src/lib/glyphs.ts": "Exports a constant object mapping hazard and status indicator names to monochrome Unicode symbols for HUD display (fire, bio, radiation, electrical, gas, warning, directional arrows).",
  "frontend/src/lib/markFeatureSets.ts": "Defines feature availability configurations for each H.E.V. Mark (I through V), controlling which stats, panels, tabs, modules, and advanced features are enabled per suit version.",
  "frontend/src/lib/markThemes.ts": "Defines visual themes for each H.E.V. Mark including color palettes (HSL values), descriptions, characteristics, and visual style classifications (industrial/combat/hybrid).",
  "frontend/src/lib/suitLoreData.ts": "Exports an array of lore sections providing background information on the H.E.V. suit's development history, Mark evolution, Black Mesa context, manufacturer details, notable incidents, technical specs, and operational doctrine.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers, then renders the main App component.",
  "frontend/src/pwa/registerServiceWorker.ts": "Exports a function to register the service worker for PWA functionality, checking for browser support and registering '/service-worker.js' on window load.",
  "frontend/src/state/audioState.ts": "Zustand store managing audio playback state including playlist, current track, play/pause/stop controls, volume, loop mode, and custom track upload functionality with an HTMLAudioElement.",
  "frontend/src/state/hazardAlerts.ts": "Manages critical hazard alert state and monitoring logic, triggering visual flashing and voice alerts when any hazard level exceeds 80%, with throttled alert notifications.",
  "frontend/src/state/hazardsState.ts": "Zustand store tracking individual hazard levels (fire, bio, radiation, electrical, gas) with methods to set levels, calculate aggregate hazard percentage, and determine hazard status labels.",
  "frontend/src/state/infoSettingsState.ts": "File appears to be empty or contains only whitespace/comments based on the truncated content shown.",
  "frontend/src/state/infoSettingsStore.ts": "Zustand store managing persistent UI/HUD settings including voice, AI, display modes, system styles (HEV/HECU/Guard/Resistance/Security), HUD opacity, HEV Mark variants, operator name, and theme toggles with computed properties and reset functionality.",
  "frontend/src/state/suitState.ts": "Zustand store managing HEV suit stats (health, armor, aux, ammo, hazard), module toggles (helmet, respirator, long jump, etc.), damage event tracking with directional indicators, and threshold checks for critical/low states.",
  "frontend/src/state/systemLog.ts": "Zustand store managing system log entries with timestamps and types (system, module, command, warning, error, hazard, radio, medical), keeping the last 100 entries.",
  "frontend/src/state/tacticalState.ts": "Zustand store managing tactical information including threat level, mission status, objectives with priorities, waypoints with distance/bearing, and engagement status (clear/contact/engaged).",
  "frontend/src/state/uiState.ts": "Zustand store managing UI state with landscape mode toggle and reset functionality.",
  "frontend/src/state/weaponSystemsState.ts": "Zustand store managing weapon selection state including selected weapon, ammo type, and fire rate with reset to default (crowbar/NONE/MELEE).",
  "frontend/src/tabs/BasicsTab.tsx": "Displays core HEV suit stats (health, armor, aux power, ammo) with meters, critical alerts, environmental hazards panel, and Mark-specific features including glitch effects and delayed stats for Mark I.",
  "frontend/src/tabs/HazardsTab.tsx": "Displays detailed environmental hazard monitoring (fire, bio, radiation, electrical, gas) with collapsible panels showing levels, trends, protection systems, and Mark-specific feature gating.",
  "frontend/src/tabs/HevTab.tsx": "Displays HEV hazard systems including contamination monitoring, radiation analysis, and environmental protection panels with themed title.",
  "frontend/src/tabs/InfoTab.tsx": "Displays comprehensive suit information including operator profile, character backstory, system diagnostics, subsystem readouts, equipment descriptions, lore, system log, and command console with system-style-specific titles.",
  "frontend/src/tabs/MedicalTab.tsx": "Renders the medical tab with readouts and interactive panels, showing an unavailable message for Mark I and II suits that lack medical system support.",
  "frontend/src/tabs/MilitaryTab.tsx": "Displays military operations interface with advanced tactical systems, weapons specifications, and squad status panels.",
  "frontend/src/tabs/SecurityTab.tsx": "Renders security operations tab featuring Black Mesa facility map, surveillance camera grid, and access control panels.",
  "frontend/src/tabs/SettingsTab.tsx": "Comprehensive settings interface for HUD configuration including voice controls, display options, faction selection, operator customization, PWA installation, and system reset functionality.",
  "frontend/src/tabs/TacticalTab.tsx": "Displays tactical information including radar, threat assessment, quick access controls, and mission briefing, with availability gated by Mark level features.",
  "frontend/src/tabs/UtilitiesTab.tsx": "Manages suit module toggles (flashlight, helmet, respirator, etc.), ambience player, radio controls, and gravity gun control with Mark-level feature filtering.",
  "frontend/src/tabs/VehiclesTab.tsx": "Fetches and displays vehicle status panels in a grid layout with loading and error states.",
  "frontend/src/tabs/WeaponsTab.tsx": "Displays detailed weapon information for Half-Life 1 arsenal including stats, lore, capabilities, fire modes, and technical specifications with collapsible sections.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (including faction-specific themes), border utilities, spacing, and OKLCH color system with shadcn/ui integration.",
  "project_state.json": "Project state file defining a Half-Life faction-based HUD system with three factions (HECU, Security, Resistance), each with unique color schemes, weapon arsenals, and H.E.V Mark selection. Includes architectural notes for responsive mobile-first design and tracks existing features like boot sequences, tab interactions, keyboard shortcuts, and quality-of-life improvements."
}