{
  "backend/main.mo": "Motoko actor defining suit stats, module toggles, hazard structures, and subsystem state management with default initialization.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend files in the HUD application.",
  "frontend/index.css": "Tailwind base/theme CSS defining color variables, dark mode tokens, and global styling.",
  "frontend/index.html": "HTML entrypoint configuring PWA meta tags, icons, manifest link, and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "Web app manifest providing PWA metadata including icons, display mode, colors, and app details.",
  "frontend/public/service-worker.js": "Service worker implementing install, activate, and fetch handlers for caching and offline fallback.",
  "frontend/src/App.tsx": "Main React app with boot sequence, display mode handling, tab routing, and service worker registration.",
  "frontend/src/audio/audioBus.ts": "Central audio bus managing SFX and voice playback with autoplay-safe unlocking and layered sound support.",
  "frontend/src/audio/hevVoice.ts": "Provides HEV-style voice playback helpers gated by a voice-enabled setting.",
  "frontend/src/audio/uiSfx.ts": "Defines UI sound effect helpers that play interface sounds when voice is enabled.",
  "frontend/src/components/audio/AmbiencePlayer.tsx": "Implements an ambience audio player with playlist control, volume, looping, and custom track upload.",
  "frontend/src/components/boot/BootSequenceOverlay.tsx": "Renders a multi-stage boot sequence with CRT effects, typed text, progress, and audio cues.",
  "frontend/src/components/hazards/EnvironmentalHazardsPanel.tsx": "Displays hazard levels with icons and status classes for multiple environmental hazard types.",
  "frontend/src/components/hud/HudGlobalEffects.tsx": "Shows global HUD visual effects like bloom, critical overlay, and presence glow respecting motion settings.",
  "frontend/src/components/hud/HudLayout.tsx": "Wraps the HUD layout with scaling, orientation handling, global effects, CRT overlays, and footer branding.",
  "frontend/src/components/hud/HudOfflineOverlay.tsx": "Shows an overlay indicating the HUD system is offline with a warning message.",
  "frontend/src/components/hud/MinimalHudView.tsx": "Displays a compact HUD with key stats and a control to restore the full HUD with sound and voice feedback.",
  "frontend/src/components/hud/Panels.tsx": "Provides reusable HUD panel components including stat panels, meters, and vitals aggregation.",
  "frontend/src/components/hud/TacticalHudShell.tsx": "Layout wrapper for the tactical HUD, showing top/bottom bars, side panels, reticle, and stat panels using suit store data.",
  "frontend/src/components/hud/TacticalOverlay.tsx": "Pure visual overlay component rendering reticles, corner frames, and tactical readouts.",
  "frontend/src/components/info/CommandConsole.tsx": "Interactive command console with input history, command execution, scrolling, and system log integration.",
  "frontend/src/components/info/ConfirmActionModal.tsx": "Reusable confirmation modal triggering UI sound effects and invoking confirm/cancel callbacks.",
  "frontend/src/components/info/SuitSubsystemReadouts.tsx": "Displays suit subsystem statuses and toggles with confirmation flows, log entries, and audio/voice feedback.",
  "frontend/src/components/info/SystemLogView.tsx": "Scrollable display of formatted system log entries with timestamps and type labels.",
  "frontend/src/components/medical/MedicalDiagram.tsx": "Renders a medical diagram image with color‑coded body part overlays based on health and armor values.",
  "frontend/src/components/medical/MedicalReadouts.tsx": "Shows computed medical stats such as vitals, trauma data, and hazard-derived values using suit and hazard stores.",
  "frontend/src/components/tactical/RadarPanel.tsx": "Canvas-based radar component with animated sweep, rings, crosshairs, and deterministic contacts rendered with pulsing markers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAutoUiScale.ts": "Computes a responsive UI scale based on viewport width with configurable min/max values and resize handling.",
  "frontend/src/hooks/useHudPresence.ts": "Tracks pointer and touch activity to update CSS variables for HUD interaction effects using rAF throttling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for authentication via Internet Identity, managing login state, identity loading, and client configuration.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls for stats and module state queries plus mutations for updating stats and toggling modules.",
  "frontend/src/hooks/useReducedMotion.ts": "Detects the user's reduced-motion preference via matchMedia and returns a boolean flag.",
  "frontend/src/hooks/useViewportOrientation.ts": "Determines if the device is in landscape orientation using matchMedia with resize and orientation listeners.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive HUD theming, color variables, and visual overlays like CRT, scanlines, and bloom.",
  "frontend/src/lib/commands.ts": "Implements a text command parser that updates suit, hazard, and UI state and logs actions.",
  "frontend/src/lib/glyphs.ts": "Provides a set of monochrome Unicode glyphs for hazards, indicators, and directional icons.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker on page load for PWA support.",
  "frontend/src/state/audioState.ts": "Zustand store managing audio playback, playlist control, volume, and custom track loading.",
  "frontend/src/state/hazardAlerts.ts": "Monitors hazard levels to trigger critical flashing and throttled voice alerts.",
  "frontend/src/state/hazardsState.ts": "Zustand store tracking per-hazard levels with setters, aggregation, status evaluation, and reset.",
  "frontend/src/state/infoSettingsState.ts": "Stores HUD and info settings like color scheme, display mode, voice, and UI scale.",
  "frontend/src/state/suitState.ts": "Zustand store for suit stats and modules with setters, toggles, and reset.",
  "frontend/src/state/systemLog.ts": "Maintains a log of system events with timestamped entries and a clear function.",
  "frontend/src/state/uiState.ts": "Simple UI state store managing landscape mode toggling.",
  "frontend/src/state/weaponSystemsState.ts": "Stores selected weapon, ammo type, and fire rate with setters and reset.",
  "frontend/src/tabs/BasicsTab.tsx": "Renders core suit statistics, hazards, and vitals using various HUD panels.",
  "frontend/src/tabs/HazardsTab.tsx": "UI tab showing hazard levels, trends, environmental stats, and filtering options using hazard store data.",
  "frontend/src/tabs/InfoTab.tsx": "Displays subsystem readouts, system logs, and a command console panel.",
  "frontend/src/tabs/MedicalTab.tsx": "Renders the medical readouts component inside the tab.",
  "frontend/src/tabs/SettingsTab.tsx": "Provides UI for configuring HUD, voice, display, and system settings with logging and restart handling.",
  "frontend/src/tabs/TacticalTab.tsx": "Shows tactical radar, status readouts, and a contact list within HUD panels.",
  "frontend/src/tabs/UtilitiesTab.tsx": "Manages toggles for suit modules and includes an ambience audio player.",
  "frontend/src/tabs/WeaponsTab.tsx": "Displays weapon information with collapsible details using weapon system store data.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, borders, radius, and enabling plugins for animations and typography.",
  "project_state.json": "JSON describing project state, existing mobile/PWA-related features, and pending requests for default display mode, installable PWA, and mobile UI improvements."
}