{
  "backend/main.mo": "Defines actor with suit stats, module toggles, life‑support systems, and detailed environmental hazard structures with initial state values.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing purposes and behaviors of various frontend files across the HUD system.",
  "frontend/index.css": "Tailwind base layer defining HUD color variables for light and dark modes along with global background and text styling.",
  "frontend/index.html": "Entry HTML file providing root element and loading main TypeScript module.",
  "frontend/src/App.tsx": "Main React app handling boot sequence, display modes, tab navigation including new Hazard tab, and mounting hazard simulation.",
  "frontend/src/audio/audioBus.ts": "Provides central audio bus for SFX and voice playback with safe initialization and autoplay‑restriction handling.",
  "frontend/src/audio/hevVoice.ts": "Defines HEV voice playback helpers for module actions, alerts, and state changes using audioBus.",
  "frontend/src/audio/uiSfx.ts": "Provides UI sound‑effect helpers for tab switches, toggles, console input, and settings changes.",
  "frontend/src/components/audio/AmbiencePlayer.tsx": "Interactive ambience audio player with playlist control, volume, looping, and custom track upload.",
  "frontend/src/components/boot/BootSequenceOverlay.tsx": "Animated boot sequence overlay that types system lines, plays audio cues, and fades out before signaling completion.",
  "frontend/src/components/hazards/EnvironmentalHazardsPanel.tsx": "Displays environmental hazard levels with icons, status text, and severity-based styling.",
  "frontend/src/components/hud/HudGlobalEffects.tsx": "Renders global HUD visual effects such as bloom, critical flashing, and presence glow with reduced‑motion handling.",
  "frontend/src/components/hud/HudLayout.tsx": "Main HUD container applying color schemes, scaling, layout modes, CRT effects, and global overlays around app content.",
  "frontend/src/components/hud/HudOfflineOverlay.tsx": "Simple overlay indicating the HUD system is offline with a warning message.",
  "frontend/src/components/hud/MinimalHudView.tsx": "Compact HUD view showing key vitals and a control to restore the full standard HUD.",
  "frontend/src/components/hud/Panels.tsx": "Reusable HUD panel components including stat meters, vitals panel, and generic panel wrappers.",
  "frontend/src/components/hud/TacticalHudShell.tsx": "Tactical HUD layout with combat modules, sidebars, reticle, and stat displays surrounding custom content.",
  "frontend/src/components/hud/TacticalOverlay.tsx": "Renders a tactical HUD overlay with corner frames, center reticle, and multiple system readouts.",
  "frontend/src/components/info/CommandConsole.tsx": "Implements an interactive command console with input handling, history navigation, and command execution.",
  "frontend/src/components/info/ConfirmActionModal.tsx": "Provides a confirmation modal using alert-dialog components with configurable text and callbacks.",
  "frontend/src/components/info/SuitSubsystemReadouts.tsx": "Displays suit subsystem statuses and allows toggling systems with confirmation prompts and log entries.",
  "frontend/src/components/info/SystemLogView.tsx": "Shows system log entries in a scrollable list with timestamps and type formatting.",
  "frontend/src/components/medical/MedicalDiagram.tsx": "Displays a medical diagram with colored overlays indicating health and armor status.",
  "frontend/src/components/medical/MedicalReadouts.tsx": "Generates detailed medical statistics panels based on suit and hazard state values.",
  "frontend/src/components/tactical/RadarPanel.tsx": "Renders an animated radar sweep on canvas with deterministic contacts and status info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useHazardSimulation.ts": "Simulates periodic hazard level changes with randomized fluctuations and decay, updating the hazard store on an interval.",
  "frontend/src/hooks/useHudPresence.ts": "Tracks pointer/touch movement and updates CSS variables via rAF for reactive HUD effects.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity auth, including login, state restoration, and identity lifecycle handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating stats, module states, hazard statuses, and other actor info.",
  "frontend/src/hooks/useReducedMotion.ts": "Detects the user's reduced motion preference via matchMedia and returns a boolean flag.",
  "frontend/src/hooks/useViewportOrientation.ts": "Determines whether the device is in landscape mode using matchMedia and resize/orientation listeners.",
  "frontend/src/index.css": "Global styles and Tailwind layers defining color variables, typography, HUD layout, and UI styling.",
  "frontend/src/lib/commands.ts": "Parses slash-commands to modify suit stats, hazards, modules, settings, and logs actions.",
  "frontend/src/lib/glyphs.ts": "Defines monochrome Unicode glyphs for hazard and status icons.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider.",
  "frontend/src/state/audioState.ts": "Manages audio playback, playlist, volume, and custom tracks using Zustand.",
  "frontend/src/state/hazardAlerts.ts": "Tracks hazard levels to trigger critical flashing and plays voice alerts.",
  "frontend/src/state/hazardsState.ts": "Stores hazard levels with short history and provides trend and severity helpers.",
  "frontend/src/state/infoSettingsState.ts": "Holds HUD, voice, and display settings with update actions.",
  "frontend/src/state/suitState.ts": "Maintains suit stats and module toggles with setters and reset.",
  "frontend/src/state/systemLog.ts": "Manages a list of timestamped log entries and provides add/clear actions.",
  "frontend/src/state/uiState.ts": "Tracks UI landscape mode and provides a toggle.",
  "frontend/src/state/weaponSystemsState.ts": "Stores selected weapon, ammo type, and fire rate with setters.",
  "frontend/src/tabs/BasicsTab.tsx": "Renders core suit stats, hazards panel, and vitals display.",
  "frontend/src/tabs/HazardTab.tsx": "Displays detailed hazard levels, trends, backend statuses, and aggregate severity.",
  "frontend/src/tabs/InfoTab.tsx": "Renders the Info tab layout with subsystem readouts, system log, and command console panels.",
  "frontend/src/tabs/MedicalTab.tsx": "Displays medical readouts inside a simple tab container.",
  "frontend/src/tabs/SettingsTab.tsx": "Provides UI controls for display, HUD, voice, tactical mode, landscape mode, and system reset with logging and audio feedback.",
  "frontend/src/tabs/TacticalTab.tsx": "Shows tactical radar, readouts, and contact lists within multiple HUD panels.",
  "frontend/src/tabs/UtilitiesTab.tsx": "Manages toggles for suit modules and includes an ambience player panel.",
  "frontend/src/tabs/WeaponsTab.tsx": "Handles weapon loadout selection, ammo type and fire rate controls, and displays weapon details.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, and plugins for the project.",
  "project_state.json": "Defines project metadata and feature requirements for implementing a dedicated Hazard tab with live-updating hazard data."
}