{
  "kind": "build_request",
  "title": "Add dedicated Hazard tab with comprehensive hazards, environmental status, and simulated statistics",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Add a new dedicated \"HAZARD\" tab to the main tab navigation and render it in both STANDARD and TACTICAL display modes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "you can make a hazard TAB with everything."
        ]
      },
      "acceptanceCriteria": [
        "A new TabsTrigger labeled \"HAZARD\" is present alongside existing tabs in frontend/src/App.tsx.",
        "Selecting the HAZARD tab shows a corresponding <TabsContent value=\"hazard\"> with the Hazard tab UI.",
        "Tab switching continues to use the existing uiSfx.tabSwitch() behavior."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement a new Hazard tab UI (new component file under frontend/src/tabs) that presents (a) an \"All Hazards\" section containing all hazard categories and (b) an \"Environmental Status\" section with detailed status indicators.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "...if it is its own specialized tab then yes do all hazards."
        ]
      },
      "acceptanceCriteria": [
        "A new tab component exists (e.g., frontend/src/tabs/HazardTab.tsx) and is used by App.tsx for the hazard tab content.",
        "The Hazard tab includes an \"ALL HAZARDS\" panel that lists, at minimum, the existing hazard categories currently supported by the UI store/panels: fire/temperature, biohazard, radiation, electrical, toxic gas.",
        "The Hazard tab includes an \"ENVIRONMENTAL STATUS\" panel with multiple indicators (not just hazard %), such as temperature and life-support related readouts, shown with clear labels and nominal/warning/critical styling consistent with existing HUD panels.",
        "UI uses English labels for all user-facing text."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add live-updating simulated statistics on the Hazard tab, including continuously changing hazard levels and derived statistics (e.g., trends and aggregates) without requiring manual user input.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "and do simulated statistics."
        ]
      },
      "acceptanceCriteria": [
        "Hazard values displayed on the Hazard tab change automatically over time (simulation) while the app is running.",
        "The tab displays at least: (1) an aggregate hazard/severity value and (2) per-hazard trend indicators (e.g., rising/falling/steady) computed from recent simulated history.",
        "Simulation updates do not break existing hazard alert monitoring (frontend/src/state/hazardAlerts.ts) and can trigger critical flashing/voice behavior when simulated hazards exceed the existing thresholds."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Expand hazard data plumbing so the Hazard tab can show detailed hazard statuses (text) and include electrical hazard level alongside the other existing hazard levels.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make a hazard TAB with everything... do all hazards"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a single method or an updated existing method that returns all five hazard levels (fire, bio, radiation, electrical, gas) in one response (electrical must be included; it is currently not returned by getHazardData).",
        "Frontend includes a React Query hook (in frontend/src/hooks/useQueries.ts) to fetch the hazard statuses (backend getAllHazardStatuses) and render them on the Hazard tab.",
        "Hazard tab shows the backend-provided status text for each hazard (fire/bio/radiation/electrical/gas) when available."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit files listed in frontend.immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui)."
  ],
  "nonGoals": [
    "Implementing real sensor integration or external data feeds for hazards/environmental status (simulation/local + existing backend values only).",
    "Adding third-party real-time communication (WebSockets) for hazard updates.",
    "Redesigning unrelated tabs (Basics/Medical/Info/etc.) beyond what is needed to add the new Hazard tab entry."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}