{
  "kind": "build_request",
  "title": "Make Standard display mode default, add Android-installable PWA, and improve mobile UI scaling + touch controls",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Set the app’s default display mode to \"STANDARD\" (the mode after Tactical) on first load and after a settings reset, without requiring the user to manually switch from Tactical.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "#2. its called standard maode"
        ]
      },
      "acceptanceCriteria": [
        "A fresh app load (no prior in-memory state) starts in STANDARD display mode.",
        "Using the existing \"SYSTEM RESTART\" action resets the display mode to STANDARD.",
        "All user-facing labels remain in English (e.g., \"STANDARD\")."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an Android-installable PWA experience (APK-like install flow) by adding the required web app manifest, icons, and service worker so the app can be installed to an Android home screen from a supported browser.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "#1. yes"
        ]
      },
      "acceptanceCriteria": [
        "The app includes a valid web app manifest and is linked from the HTML entrypoint.",
        "The app registers a service worker that enables offline-capable caching of the app shell (at minimum: HTML, JS bundle(s), CSS, and static assets required to render the UI).",
        "On Android Chrome (or equivalent), the browser offers an install option (\"Add to Home screen\" / install prompt) and the installed app launches in standalone/app-like mode.",
        "PWA icons are provided in appropriate sizes and referenced by the manifest."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve mobile support with responsive UI scaling and layout adjustments so the HUD is readable and usable on common phone screen sizes (portrait and landscape), while preserving the existing UI style.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "#3. yes"
        ]
      },
      "acceptanceCriteria": [
        "UI scale is automatically optimized for small screens (in addition to the existing manual UI scale slider), without breaking desktop layout.",
        "Key navigation elements (tabs list, headers/footers, primary controls) remain readable and do not overflow/clamp on narrow widths.",
        "The layout respects mobile safe areas (e.g., notch/gesture areas) so critical controls are not obscured.",
        "No changes are required to backend APIs to achieve the scaling improvements."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Optimize controls for touch devices across the app (tap targets, touch interactions, and removal of hover-only affordances) so the interface is comfortable to use on mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "#3. yes"
        ]
      },
      "acceptanceCriteria": [
        "Interactive controls meet touch-friendly sizing (e.g., comfortably tappable triggers/buttons) without requiring zoom.",
        "Tab switching and other primary interactions work reliably via touch (no dependence on hover to discover or operate controls).",
        "Scrolling areas (e.g., tab content panels/logs) remain scrollable and do not conflict with touch interactions.",
        "Any touch interactions added do not regress mouse/keyboard behavior on desktop."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if an upgrade of stable state is required.",
    "Do not attempt to generate a true native Android APK package; implement an installable PWA experience instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers (only Internet Identity is supported).",
    "Do not add real-time communication features (WebSockets/chat/push notifications).",
    "Do not introduce external databases or non-Motoko backend services.",
    "Do not change weapon simulation/comparison features (not requested)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}