{
  "kind": "build_request",
  "title": "Make HUD tabs compact so all tabs (including Settings) are reachable",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the HUD tab bar so all tabs are reachable on small screens by reducing each tab’s visual width and supporting horizontal overflow scrolling (e.g., when the full tab set exceeds viewport width).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Maybe make the tabs not as big or make them only say they're name as I cannot get to the settings tab or other tabs at the back"
        ]
      },
      "acceptanceCriteria": [
        "On narrow/mobile-sized viewports, the tab bar does not prevent access to the Settings tab (it is reachable via horizontal scroll/drag).",
        "The tab bar does not overflow outside the viewport; extra tabs remain accessible via horizontal scrolling.",
        "No regression on desktop widths: tabs remain visible/usable without requiring scrolling when space permits."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a compact rendering mode for `HudTabsBar` that, at small widths, shows only the tab name (label) and removes/reduces secondary micro-text so each tab consumes less space while remaining readable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "make them only say they're name"
        ]
      },
      "acceptanceCriteria": [
        "At small widths, tab triggers display only the primary label (e.g., BASICS, MEDICAL, …, SETTINGS) and do not render the micro indicator line.",
        "Tab labels remain legible and do not overlap adjacent tabs; truncation/ellipsis behavior is acceptable if needed.",
        "Switching tabs still works identically (click/tap) and active styling remains clearly indicated."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (read-only UI component sources must be composed, not edited)."
  ],
  "nonGoals": [
    "Adding/removing tabs or changing tab routing logic.",
    "Backend changes to suit stats/modules/hazards."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}