{
  "kind": "build_request",
  "title": "Add melee, ranged, and magic weapon sections with static weapon info and images in Weapons tab",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Weapons tab UI (`frontend/src/tabs/WeaponsTab.tsx`) to include three clearly labeled weapon sections: MELEE, RANGED, and MAGIC, each showing a list/grid of weapon entries that the user can click to select.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "add weapon sections and info in the weapons tab",
          "yes, all, and static"
        ]
      },
      "acceptanceCriteria": [
        "Weapons tab displays three sections labeled MELEE, RANGED, and MAGIC.",
        "Each section renders multiple weapon entries (not just a single item).",
        "Clicking an entry selects that weapon and updates the weapon details panel."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace/extend the current `WEAPONS` static data in `frontend/src/tabs/WeaponsTab.tsx` to be categorized (melee/ranged/magic) and to include, for every weapon: name, description, damage, a small set of stats (e.g., accuracy, recoil, range, handling), and an image path (served from frontend static assets). Keep all weapon data static in the frontend (no backend canister calls).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes, all, and static"
        ]
      },
      "acceptanceCriteria": [
        "Every weapon entry includes fields for name, description, damage, stats, and image path.",
        "Weapon data is defined locally in the frontend (e.g., a constant in WeaponsTab or a small local module) and does not fetch from the backend.",
        "User-facing labels/descriptions are in English."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Enhance the WEAPON DETAILS panel in `frontend/src/tabs/WeaponsTab.tsx` to display the selected weapon’s image, description, damage, and stats in addition to the existing ammo type and fire rate controls (where applicable). For weapons that do not use ammo or fire rate (e.g., melee), the UI should show sensible static values and/or disable/hide irrelevant controls without breaking layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "add weapon sections and info in the weapons tab",
          "yes, all, and static"
        ]
      },
      "acceptanceCriteria": [
        "Selecting a weapon shows its image, description, damage, and stats in the details panel.",
        "Ammo type and fire rate controls behave correctly for weapons that support them.",
        "Weapons that do not support ammo/fire rate do not cause empty select dropdowns or runtime errors."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add the required weapon images as static assets under `frontend/public/assets/generated/` and reference them from the Weapons tab weapon data so each weapon entry can render an image thumbnail/preview.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes, all, and static"
        ]
      },
      "acceptanceCriteria": [
        "All newly required images exist under `frontend/public/assets/generated/`.",
        "Weapons tab renders the images using direct static paths (no backend image serving).",
        "No broken image links appear in the Weapons tab UI."
      ]
    }
  ],
  "constraints": [
    "Do not introduce any new backend canister calls for weapon data; keep weapon entries static in the frontend.",
    "Do not edit files under `frontend/src/components/ui` or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Persisting weapon loadouts or weapon definitions to the backend canister.",
    "Admin/editor UI to modify weapon entries.",
    "Adding authentication-gated weapon management workflows."
  ],
  "imageRequirements": {
    "required": [
      "Monochrome sci‑fi crowbar illustration, high-contrast HUD style (weapon-crowbar.dim_512x512.png)",
      "Monochrome sci‑fi pistol illustration, high-contrast HUD style (weapon-pistol.dim_512x512.png)",
      "Monochrome sci‑fi shotgun illustration, high-contrast HUD style (weapon-shotgun.dim_512x512.png)",
      "Monochrome sci‑fi rifle/SMG illustration, high-contrast HUD style (weapon-smg.dim_512x512.png)",
      "Monochrome gravity/energy device illustration, high-contrast HUD style (weapon-gravity-device.dim_512x512.png)",
      "Monochrome arcane staff/wand illustration, high-contrast HUD style (weapon-arcane-staff.dim_512x512.png)"
    ],
    "edits": []
  }
}