{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Categorized static Weapons tab with weapon details and thumbnails",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update Weapons tab to render three labeled sections (MELEE/RANGED/MAGIC) with clickable weapon entries that drive selection.",
      "acceptanceCriteria": [
        "Weapons tab displays three sections labeled MELEE, RANGED, and MAGIC.",
        "Each section renders multiple weapon entries (not just a single item).",
        "Clicking an entry selects that weapon and updates the weapon details panel."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/WeaponsTab.tsx",
          "operation": "modify",
          "description": "Refactor the loadout area into three clearly labeled sections (MELEE, RANGED, MAGIC) that each render a grid/list of weapon entry cards and call the existing selection handler when clicked. Keep tab layout consistent with existing Tactical/HUD panel patterns and ensure selection styling remains clear. Continue using the existing shadcn-ui Select component for consistency where dropdown controls remain (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace/extend static WEAPONS data with categorized weapon definitions including name/description/damage/stats/image path (frontend-only).",
      "acceptanceCriteria": [
        "Every weapon entry includes fields for name, description, damage, stats, and image path.",
        "Weapon data is defined locally in the frontend (e.g., a constant in WeaponsTab or a small local module) and does not fetch from the backend.",
        "User-facing labels/descriptions are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/weaponsData.ts",
          "operation": "create",
          "description": "Create a small frontend-only static module exporting categorized weapon data (melee/ranged/magic). Each weapon should include: id, name (English), description (English), damage (static display value), a small stats object (e.g., accuracy/recoil/range/handling as numbers or labeled values), imagePath (pointing to frontend/public assets), plus fields indicating whether ammo type and fire rate controls apply (and the allowed values when they do). No backend calls. Ensure imagePath values reference the exact generated files under frontend/public/assets/generated/."
        },
        {
          "path": "frontend/src/tabs/WeaponsTab.tsx",
          "operation": "modify",
          "description": "Replace the inline WEAPONS constant with imports from the new static data module, update lookups for selected weapon, and ensure the tab renders categorized sections from that module. Ensure all user-facing labels/descriptions remain English and do not introduce any backend canister calls for weapon data."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Enhance Weapon Details panel to show image/description/damage/stats and handle ammo/fire-rate controls only when applicable.",
      "acceptanceCriteria": [
        "Selecting a weapon shows its image, description, damage, and stats in the details panel.",
        "Ammo type and fire rate controls behave correctly for weapons that support them.",
        "Weapons that do not support ammo/fire rate do not cause empty select dropdowns or runtime errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/WeaponsTab.tsx",
          "operation": "modify",
          "description": "Extend the WEAPON DETAILS panel to render the selected weapon’s thumbnail image, English description, damage, and stats. Preserve existing ammo type and fire rate controls, but conditionally disable/hide them (or replace with sensible static readouts like 'NONE'/'N/A') for weapons that do not support those controls, ensuring no empty dropdowns and no runtime errors. Continue using the existing shadcn-ui Select component for ammo/fire-rate controls where applicable (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add required weapon images as generated static assets and wire them into weapon data for thumbnails/previews.",
      "acceptanceCriteria": [
        "All newly required images exist under `frontend/public/assets/generated/`.",
        "Weapons tab renders the images using direct static paths (no backend image serving).",
        "No broken image links appear in the Weapons tab UI."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/weapon-crowbar.dim_512x512.png",
          "operation": "create",
          "description": "Add generated static image asset for the crowbar weapon at frontend/public/assets/generated/weapon-crowbar.dim_512x512.png and ensure it is referenced by at least one weapon entry in the static weapons data."
        },
        {
          "path": "frontend/public/assets/generated/weapon-pistol.dim_512x512.png",
          "operation": "create",
          "description": "Add generated static image asset for the pistol weapon at frontend/public/assets/generated/weapon-pistol.dim_512x512.png and ensure it is referenced by at least one weapon entry in the static weapons data."
        },
        {
          "path": "frontend/public/assets/generated/weapon-shotgun.dim_512x512.png",
          "operation": "create",
          "description": "Add generated static image asset for the shotgun weapon at frontend/public/assets/generated/weapon-shotgun.dim_512x512.png and ensure it is referenced by at least one weapon entry in the static weapons data."
        },
        {
          "path": "frontend/public/assets/generated/weapon-smg.dim_512x512.png",
          "operation": "create",
          "description": "Add generated static image asset for the rifle/SMG weapon at frontend/public/assets/generated/weapon-smg.dim_512x512.png and ensure it is referenced by at least one weapon entry in the static weapons data."
        },
        {
          "path": "frontend/public/assets/generated/weapon-gravity-device.dim_512x512.png",
          "operation": "create",
          "description": "Add generated static image asset for the gravity/energy device weapon at frontend/public/assets/generated/weapon-gravity-device.dim_512x512.png and ensure it is referenced by at least one weapon entry in the static weapons data."
        },
        {
          "path": "frontend/public/assets/generated/weapon-arcane-staff.dim_512x512.png",
          "operation": "create",
          "description": "Add generated static image asset for the arcane staff/wand weapon at frontend/public/assets/generated/weapon-arcane-staff.dim_512x512.png and ensure it is referenced by at least one weapon entry in the static weapons data."
        },
        {
          "path": "frontend/src/lib/weaponsData.ts",
          "operation": "modify",
          "description": "Ensure all weapon entries reference the exact new static asset paths (frontend/public/assets/generated/weapon-crowbar.dim_512x512.png, frontend/public/assets/generated/weapon-pistol.dim_512x512.png, frontend/public/assets/generated/weapon-shotgun.dim_512x512.png, frontend/public/assets/generated/weapon-smg.dim_512x512.png, frontend/public/assets/generated/weapon-gravity-device.dim_512x512.png, frontend/public/assets/generated/weapon-arcane-staff.dim_512x512.png) and that the Weapons tab UI uses those paths directly so there are no broken image links."
        }
      ]
    }
  ]
}