{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize Utilities module toggles using backend-refetched module state",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Make Utilities module switches derive from the React Query 'modules' state with optimistic UI + rollback on failure, staying stable across refetch and navigation.",
      "acceptanceCriteria": [
        "In the Utilities tab, toggling any module switch stays in the new position after the mutation settles and the `modules` query invalidates/refetches.",
        "If the backend toggle fails, the UI rolls back to the previous state (no permanent mismatch between switch UI and backend `getModuleStates`).",
        "Switches remain correct after navigating away from the Utilities tab and returning (i.e., after re-render and refetch)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the `useToggleModule` mutation to be query-cache-driven (optimistic update of the React Query ['modules'] cache and rollback on error) and remove direct Zustand module toggling to ensure the post-mutation UI is governed by backend-refetched module state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/tabs/UtilitiesTab.tsx",
          "operation": "modify",
          "description": "Change module switch `checked` values and toggle calculations to rely on the React Query `useGetModuleStates()` data (fall back safely when unavailable) so switches do not visually revert except on mutation failure; keep using `HudSwitch` (shadcn-ui Switch wrapper) for consistent styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the existing module-state synchronization from the React Query `modules` query into the Zustand suit store remains the single source of truth for other tabs, and does not reintroduce local-only module toggles that could desync during invalidation/refetch. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}