{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Compact, scrollable HUD tabs for small screens",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make HUD tabs horizontally scrollable and reduce per-tab width so all tabs remain reachable on small screens.",
      "acceptanceCriteria": [
        "On narrow/mobile-sized viewports, the tab bar does not prevent access to the Settings tab (it is reachable via horizontal scroll/drag).",
        "The tab bar does not overflow outside the viewport; extra tabs remain accessible via horizontal scrolling.",
        "No regression on desktop widths: tabs remain visible/usable without requiring scrolling when space permits."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/hud/HudTabsBar.tsx",
          "operation": "modify",
          "description": "Adjust the HudTabsBar markup/classes to support an overflow-x scrolling tab list (including touch/pointer horizontal drag scrolling) and to ensure tab triggers size to content (reduced padding/min-width) rather than forcing equal-width tabs."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust CSS for HudTabsBar (e.g., `hud-tabs-list-enhanced` / `hud-tab-trigger-enhanced` and related sub-elements) to enable horizontal overflow scrolling within the viewport, prevent layout overflow, hide/trim scrollbars appropriately, and tighten spacing so more tabs fit on small screens while remaining usable on desktop."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a compact visual mode for HudTabsBar at small widths that shows only the primary tab label and removes micro-text.",
      "acceptanceCriteria": [
        "At small widths, tab triggers display only the primary label (e.g., BASICS, MEDICAL, …, SETTINGS) and do not render the micro indicator line.",
        "Tab labels remain legible and do not overlap adjacent tabs; truncation/ellipsis behavior is acceptable if needed.",
        "Switching tabs still works identically (click/tap) and active styling remains clearly indicated."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/hud/HudTabsBar.tsx",
          "operation": "modify",
          "description": "Introduce a compact rendering behavior for HudTabsBar (e.g., by adding a compact-mode class or structure that allows hiding the micro line and optionally reducing non-label elements at small widths) while keeping tab values and switching logic unchanged."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Implement responsive compact styling for HudTabsBar at small widths (via media queries and/or a compact-mode class): hide `.tab-trigger-micro` (micro indicator line), ensure `.tab-trigger-label` remains readable with nowrap + ellipsis as needed, and keep active-state styling clearly visible."
        }
      ]
    }
  ]
}